[
  {
    "title": "House Prepares Vote to End Longest Government Shutdown",
    "details": "The House returns after a 54-day recess to vote on a Senate-passed bill ending the 43-day shutdown, funding government through January. The shutdown stemmed from partisan disputes over spending, leaving federal workers unpaid and disrupting services like air travel and food assistance. Approval would restore jobs, back pay, and stability, averting further economic drag. For everyday Americans, this prioritizes swift resolution to protect livelihoods and national security without unnecessary Democratic concessions.",
    "source": "https://www.nytimes.com/2025/11/12/us/politics/house-vote-government-shutdown.html"
  },
  {
    "title": "Epstein Emails Claim Trump Knew About Victims, Democrats Allege",
    "details": "House Democrats released Epstein estate emails alleging Trump spent hours with a victim and knew about the girls, referencing interactions at Epstein's home. The emails, from 2011 and 2019, involve exchanges with Ghislaine Maxwell and author Michael Wolff, amid a falling out between Trump and Epstein in 2004. The White House calls it a Democratic smear, noting the victim Virginia Giuffre denied Trump's wrongdoing and he banned Epstein from Mar-a-Lago. This underscores the need for full transparency to safeguard American justice without political weaponization.",
    "source": "https://www.cbsnews.com/news/jeffrey-epstein-donald-trump-emails-house-oversight/"
  },
  {
    "title": "Unemployment's Hidden Toll on Mental Health Revealed",
    "details": "Long-term unemployment affects nearly 26% of jobless Americans, leading to depression, anxiety, and substance issues amid mass layoffs at major firms. Experts highlight the emotional crisis, with stories of demoralized workers struggling for months despite qualifications. Building support networks and speaking out can mitigate impacts during economic shifts. Focusing on domestic job creation first bolsters American resilience and family stability.",
    "source": "https://www.nytimes.com/2025/11/12/well/mind/unemployment-mental-health.html"
  },
  {
    "title": "Trump's Approval Dips on Shutdown Handling, Poll Shows",
    "details": "AP-NORC poll reveals Trump's government management approval at 33%, down amid shutdown woes and economic concerns. Republican support fell to 68%, independents to 25%, linked to federal disruptions. This reflects public frustration with delays. Ending shutdowns efficiently upholds America First by stabilizing economy and services for citizens.",
    "source": "https://apnews.com/live/donald-trump-news-updates-11-12-2025"
  },
  {
    "title": "Hegseth Defends Military Strikes on Drug Cartels",
    "details": "Defense Secretary Pete Hegseth affirms legal basis for US strikes on cartel smuggling boats, likening them to al-Qaida threats. Actions killed 75, amid speculation on Venezuela's Maduro after Republican Senate block on checks. This combats drug influx devastating American communities. Aggressive anti-cartel measures prioritize homeland security and save lives.",
    "source": "https://apnews.com/live/donald-trump-news-updates-11-12-2025"
  },
  {
    "title": "White House Blasts Democrats Over Epstein Email Leaks",
    "details": "White House accuses Democrats of fabricating smears via selective Epstein email releases implicating Trump with victims. Spokesperson notes Giuffre's clearances and Trump's Epstein ban for misconduct. Releases distract from shutdown resolution and achievements. Full disclosure serves justice, but politicization undermines American trust in institutions.",
    "source": "https://www.theguardian.com/us-news/live/2025/nov/12/donald-trump-us-government-shutdown-house-democrats-republicans-latest-news-updates"
  },
  {
    "title": "Trump Urges Israel to Pardon Netanyahu in Letter",
    "details": "Trump requests Israeli President Herzog pardon Benjamin Netanyahu, calling corruption trials politically motivated against a wartime leader. The letter praises Netanyahu's alliance with US interests. This bolsters key Middle East ties. Strengthening alliances with reliable partners advances America First foreign policy.",
    "source": "https://www.theguardian.com/us-news/live/2025/nov/12/donald-trump-us-government-shutdown-house-democrats-republicans-latest-news-updates"
  },
  {
    "title": "Maxwell Seeks Trump Commutation, Whistleblower Claims",
    "details": "House Democrats reveal whistleblower info that Ghislaine Maxwell seeks presidential commutation for her 20-year sentence. Rep. Raskin urges denial to uphold justice for victims. Amid file release pushes, this tests clemency decisions.",
    "source": "https://www.theguardian.com/us-news/live/2025/nov/12/donald-trump-us-government-shutdown-house-democrats-republicans-latest-news-updates"
  },
  {
    "title": "Syrian Leaders Commit to Anti-ISIS Coalition Efforts",
    "details": "Syrian forces pledge deeper cooperation with global anti-ISIS coalition since December, targeting remnants. This follows territorial losses but ongoing threats to stability. Enhanced partnerships aid in preventing resurgence affecting US interests. Supporting allies against terrorism prioritizes American security without endless commitments.",
    "source": "https://www.nytimes.com/2025/11/12/world/middleeast/syria-isis-islamic-state.html"
  }
]