[
  {
    "title": "New Epstein Emails Suggest Trump Knew of Misconduct",
    "details": "House Democrats released emails where Jeffrey Epstein claimed President Trump spent hours at his home with an underage victim. The emails, unsealed today, detail Epstein's boasts about his ties to Trump before the 2016 election. This revelation could fuel ongoing investigations into Epstein's network and Trump's past associations. From an America First perspective, it underscores the need to protect American youth from elite predators, prioritizing domestic justice over international alliances.",
    "source": "https://www.nytimes.com/2025/11/12/us/politics/trump-epstein-emails.html"
  },
  {
    "title": "House Prepares Vote to End Prolonged Government Shutdown",
    "details": "The US House is set for a crucial vote on a budget bill to resolve the historic government shutdown, now in its sixth week. The shutdown has furloughed thousands of federal workers and disrupted services nationwide. Approval could restore normal operations and boost economic confidence. America First demands efficient governance to keep America running strong without unnecessary delays.",
    "source": "https://www.bbc.com/news/articles/cr437q69422o"
  },
  {
    "title": "White House Denies Epstein Allegations Against Trump",
    "details": "The White House dismissed Democratic claims from Epstein's emails suggesting Trump's involvement with victims, calling it a smear campaign. Spokesperson emphasized no wrongdoing by the president in Epstein's activities. This comes as shutdown talks intensify in Congress. Upholding America First means defending leaders from partisan attacks to focus on national priorities like border security and economy.",
    "source": "https://www.theguardian.com/us-news/live/2025/nov/12/donald-trump-us-government-shutdown-house-democrats-republicans-latest-news-updates"
  },
  {
    "title": "Trump Urges GOP to Highlight Economic Achievements",
    "details": "President Trump expressed frustration with Republicans for not promoting his administration's economic successes amid current woes. In a White House tour with Fox News, he touted record growth and low unemployment pre-shutdown. Voter backlash highlights the need for unified messaging on fiscal wins. America First economics put American workers first, countering inflation with proven policies over foreign spending.",
    "source": "https://www.foxnews.com/media/trump-grows-frustrated-gop-not-touting-his-greatest-economy-history"
  },
  {
    "title": "Anthropic Plans $50 Billion US Data Centers Investment",
    "details": "AI firm Anthropic announced a $50 billion investment to build data centers across the US, aiming to meet surging AI demand. This move will create thousands of high-tech jobs and bolster domestic infrastructure. It positions America as a leader in AI innovation amid global competition. America First tech strategy secures economic benefits and technological sovereignty for US workers.",
    "source": "https://www.reuters.com/technology/anthropic-invest-50-bln-build-data-centers-us-2025-11-12/"
  },
  {
    "title": "Ukraine Corruption Scandal Involves Zelenskyy Ally",
    "details": "A $100 million corruption probe in Ukraine has suspended the justice minister, linked to kickbacks in a Zelenskyy ally's scheme. The scandal undermines US aid efforts to the war-torn nation. International partners demand accountability. America First foreign policy insists on transparency in aid to prevent waste of American taxpayer dollars on corrupt regimes.",
    "source": "https://www.nbcnews.com/world/ukraine/100m-corruption-scandal-rocks-ukraine-embroils-top-zelenskyy-ally-rcna12345"
  },
  {
    "title": "Google Sues Scammers Behind Phishing Operation",
    "details": "Google filed a lawsuit against 25 individuals running a phishing-as-a-service scam called Lighthouse, targeting users with fraudulent texts. The operation allegedly defrauded millions globally. Legal action aims to dismantle the network. Protecting American users from cyber threats aligns with America First cybersecurity, safeguarding personal data and national digital infrastructure.",
    "source": "https://www.wired.com/story/google-sues-phishing-scam-lighthouse/"
  },
  {
    "title": "Brazil Tightens Cyber Rules After Attack Surge",
    "details": "Brazil's central bank announced stricter regulations following a wave of cyberattacks on its financial system. The measures include enhanced security protocols for banks. This responds to rising global cyber risks. America First encourages strong international cyber defenses to prevent threats from spilling over and disrupting US financial ties.",
    "source": "https://www.reuters.com/technology/brazil-central-bank-cyber-rules-2025-11-12/"
  }
]