[
  {
    "title": "House Prepares to Vote on Ending Government Shutdown",
    "details": "The U.S. House reconvened to vote on a bill ending the 43-day government shutdown, funding operations through January 30 with back pay for workers. This follows Senate passage amid partisan blame over health care extensions. The shutdown disrupted economic data and growth, highlighting inefficiencies in bipartisan negotiations that prolonged public hardship.",
    "source": "https://apnews.com/live/donald-trump-news-updates-11-12-2025"
  },
  {
    "title": "Dow Hits Record High as Shutdown Nears End",
    "details": "The Dow achieved a record close amid mixed indexes, fueled by hopes of resolving the longest U.S. shutdown. Tech heavyweights dragged the Nasdaq, while healthcare and financials rose. Effects include restored worker pay and air traffic, but highlight bureaucratic inefficiencies wasting taxpayer resources.",
    "source": "https://www.reuters.com/world/asia-pacific/us-stock-futures-advance-investors-cheer-possible-end-federal-shutdown-2025-11-12/"
  },
  {
    "title": "House Set for Evening Vote on Shutdown Bill",
    "details": "The House plans a vote to end the 43-day shutdown, restoring federal operations and air travel. Disruptions included flight cuts and data gaps, with Trump supporting the measure. Effects strain workers and economy, revealing governmental inefficiencies in crisis management. From an America First angle, this hypocrisy prolongs unintended suffering for U.S.",
    "source": "https://www.nytimes.com/live/2025/11/12/us/trump-government-shutdown-news"
  },
  {
    "title": "Epstein Files Petition Hits House Threshold",
    "details": "A bipartisan petition reached 218 signatures to force a vote on releasing Epstein files after a delayed swearing-in. Emails suggest Trump ties, sparking White House denials. Impacts include renewed survivor advocacy and political tension. An America First view exposes hypocritical elite protections, causing unintended public distrust in institutions meant to serve Americans first.",
    "source": "https://www.theguardian.com/us-news/live/2025/nov/12/donald-trump-us-government-shutdown-house-democrats-republicans-latest-news-updates"
  },
  {
    "title": "House Debates Funding to End Shutdown",
    "details": "The House debated a bill to reopen government, including back pay and agency funding amid partisan clashes over health credits. Shutdown caused layoffs and data blackouts. Effects burden federal workers and economy, underscoring negotiation inefficiencies. America First perspective sees hypocrisy in delays, with unintended consequences harming U.S.",
    "source": "https://www.cbsnews.com/live-updates/government-shutdown-latest-house-vote-senate-deal-trump/"
  },
  {
    "title": "Defense Tech Attracts Mission-Driven Students",
    "details": "Students at Stanford prioritize defense tech for purpose over pay, shifting from traditional tech jobs. This trend boosts recruitment for firms like Anduril amid innovation needs. Impacts strengthen U.S. military tech edge, but reveal inefficiencies in talent allocation.",
    "source": "https://www.bloomberg.com/news/newsletters/2025-11-12/defense-tech-lures-students-looking-for-mission-over-money"
  },
  {
    "title": "Turkish Military Plane Crashes in Georgia",
    "details": "A Turkish C-130 plane crashed in Georgia, killing all 20 air force members en route from Azerbaijan. The cause is under investigation amid regional tensions. Effects include diplomatic condolences and safety reviews. An America First angle sees inefficiencies in foreign military ops, with hypocritical alliances causing unintended risks to allied personnel.",
    "source": "https://abcnews.go.com/International/turkish-military-plane-crash-georgia-kills-20/story?id=115693821"
  },
  {
    "title": "Wall Street Closes Mixed Amid Shutdown Optimism",
    "details": "Wall Street ended mixed with Dow gains driven by healthcare and energy, while tech declined on valuation concerns. Optimism over the shutdown's end boosted sentiment, though light volume persisted. This rotation underscores market sensitivity to political resolutions, but reveals inefficiencies in delayed data impacting Fed decisions. America First view critiques government paralysis causing unintended volatility, prioritizing domestic stability over partisan games.",
    "source": "https://finance.yahoo.com/news/stock-market-news-nov-12-144600218.html"
  },
  {
    "title": "Americans Grow Anxious Over Job Security",
    "details": "A poll shows 55% of employed Americans fear job loss amid rising layoffs and costs. Slowing job growth and inflation persist despite tariff aims to boost manufacturing. This anxiety affects consumer sentiment and elections, exposing inefficiencies in policies not addressing core affordability. America First analysis notes hypocrisy in trade measures that unintentionally heighten domestic economic fears.",
    "source": "https://www.latimes.com/business/story/2025-11-12/its-not-just-affordability-americans-anxious-over-jobs-too"
  },
  {
    "title": "Trump Officials Meet on Epstein Files Release",
    "details": "Administration officials met with a GOP lawmaker on forcing Epstein file releases via House petition. The move follows new emails mentioning Trump, dismissed as a hoax. This scrutiny divides parties, potentially affecting public trust. America First critique highlights inefficiencies in delayed transparency, with hypocritical cover-ups leading to unintended erosion of national confidence.",
    "source": "https://www.cnn.com/2025/11/12/politics/trump-administration-meeting-house-effort-epstein-document-release"
  },
  {
    "title": "Town Seeks Return of Missing Mannequin Landmark",
    "details": "A New Zealand town pleads for tips on their stolen dam mannequin, a beloved quirky attraction. The disappearance disrupts local identity and tourism. Effects include community upset, highlighting odd cultural attachments. From an America First lens, this lighthearted inefficiency mirrors wasteful distractions, with unintended humor exposing hypocrisies in prioritizing novelties over practical needs.",
    "source": "https://www.upi.com/Odd_News/2025/11/12/nz-Nieu-Bethesda-mannequin-Beverly-missing-stolen/4061762970141/"
  },
  {
    "title": "UK Halts Intel Sharing with US on Drug Strikes",
    "details": "The UK stopped sharing drug trafficking intel with the US over legal concerns on strikes, while Canada continues cautiously. This stems from U.S. operations in the Caribbean. Impacts strain alliances and anti-drug efforts, revealing coordination inefficiencies.",
    "source": "https://www.justsecurity.org/124486/early-edition-november-12-2025/"
  },
  {
    "title": "Fed Official Discusses Treasury Market Evolution",
    "details": "New York Fed President reviewed policy framework using game analogies, noting tools like repo facilities for stability. Context includes past market stresses and reserve management. Effects enhance rate control amid shutdown data gaps. America First analysis highlights inefficiencies in federal disruptions, with hypocritical delays causing unintended market volatility for Americans.",
    "source": "https://www.newyorkfed.org/newsevents/speeches/2025/wil251112"
  },
  {
    "title": "Atlanta Fed President Warns on Inflation Risks",
    "details": "Raphael Bostic urged maintaining restrictive policy due to persistent inflation above target, citing surveys and tariffs. Labor market shows balance despite slowdowns. Impacts guide Fed decisions amid data shortages. From an America First standpoint, this exposes hypocritical global trade effects, unintentionally burdening U.S.",
    "source": "https://www.atlantafed.org/news/speeches/2025/11/12/bostic-weighing-the-risks-why-inflation-tips-the-scales"
  },
  {
    "title": "Euronews Midday Bulletin Covers Global Stories",
    "details": "Euronews' midday bulletin summarized key European and world news, including politics and business updates. It provides broad coverage for informed audiences. Effects foster global awareness, but highlight media fragmentation. America First critique notes inefficiencies in international focus, with hypocritical emphasis leading to unintended neglect of domestic priorities.",
    "source": "https://www.euronews.com/video/2025/11/12/latest-news-bulletin-november-12th-2025-midday"
  }
]