[
  {
    "title": "House Votes to End Longest US Government Shutdown",
    "details": "The U.S. House is voting on a bill to end the 42-day government shutdown that began October 1, 2025, after Senate approval, with President Trump set to sign it and restore funding through January 30. This historic shutdown has disrupted air travel, delayed federal paychecks, and stalled operations amid rising national debt trends and partisan fiscal fights. It burdens the economy with stalled growth, threatens security via workforce cuts, and hits families hard by risking SNAP food aid disruptions, though the deal secures it until September 2026.",
    "source": "https://www.reuters.com/world/us/us-house-returns-washington-vote-end-government-shutdown-2025-11-11/"
  },
  {
    "title": "Chronic Kidney Disease Rises to Ninth Global Killer",
    "details": "Chronic kidney disease (CKD) has climbed to the ninth leading cause of global death, with cases doubling to 788 million from 378 million in 1990, killing 1.5 million last year and affecting 14% of adults. Driven by rising blood sugar, hypertension, and obesity in the U.S. and worldwide, CKD often goes undetected early, contributing to 12% of cardiovascular deaths and straining healthcare systems. It imposes heavy economic costs through dialysis and transplants, heightens security risks via linked heart issues, and burdens families with caregiving demands and disabilities.",
    "source": "https://nypost.com/2025/11/11/health/killer-condition-lands-in-top-10-leading-causes-of-death-as-global-cases-surge/"
  },
  {
    "title": "UK Slashes Aid to Global Fund Fighting Deadly Diseases",
    "details": "Britain committed 850 million pounds ($1.14 billion) to the Global Fund against AIDS, TB, and malaria for 2026-2028, down 15% from prior pledges due to tight budgets and rising defense priorities. This mirrors a trend among major donors shifting funds from global health to national security amid economic pressures. The cut could save 1.3 million lives globally but signals reduced international support, with indirect U.S. effects on disease spread and trade; families benefit from stable domestic focus.",
    "source": "https://www.reuters.com/business/healthcare-pharmaceuticals/uk-pledges-850-million-pounds-global-disease-fight-2025-11-11/"
  },
  {
    "title": "Israeli AI Firm Wonderful Secures $100M Funding Boost",
    "details": "Israeli AI startup Wonderful raised $100 million in its second round, led by Index Ventures, valuing it at $700 million after a $34 million debut in July for its multilingual customer service platform. Amid booming global AI investments, the Amsterdam-headquartered firm with Israeli R&D eyes $10 million annual revenue in 2025 and expansion into Europe, Middle East, and Asia. It spurs economic innovation and jobs, strengthens enterprise security with adaptive AI, and aids family-run businesses via efficient tools. America First takeaway: U.S.",
    "source": "https://www.reuters.com/technology/israeli-ai-startup-wonderful-raises-another-100-million-valued-700-million-2025-11-11/"
  },
  {
    "title": "Arctic Blast Hits Tri-State with Early Snow and Freeze",
    "details": "A polar vortex from Canada brought New York City's first snow flurries and arctic air, with tri-state highs in the low 40s, wind chills to 25 degrees, and freeze warnings for over 100 million Americans. This early winter surge, tied to a dipping jet stream, brings light snow risks without major NYC accumulation but heavier falls elsewhere, part of rising extreme weather patterns. It disrupts travel and daily life, straining emergency services and family schedules while posing slip hazards. America First takeaway: Bolstering U.S.",
    "source": "https://nypost.com/2025/11/11/us-news/polar-vortex-sends-arctic-blast-into-new-york-putting-tri-state-under-freeze-warning/"
  },
  {
    "title": "S&P 500 Dips as ADP Data Signals Labor Market Weakness",
    "details": "The S&P 500 and Nasdaq slipped Tuesday amid labor softening, with ADP reporting over 11,000 weekly private job losses through late October and Goldman forecasting a 50,000 October payroll drop from shutdown deferrals. Senate's spending bill to end the shutdown heads to House and Trump, promising delayed September jobs data release. This underscores economic uncertainty trends, risking fiscal instability and family finances via unemployment, while lifting gold and silver prices. America First takeaway: Shutdown resolution under Trump stabilizes markets and bolsters domestic employment.",
    "source": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-11-11-2025"
  },
  {
    "title": "Trump Pardons Giuliani and 70 in Election Overturn Case",
    "details": "President Trump pardoned Rudy Giuliani and over 70 linked to 2020 election challenges, as eight Senate Democrats backed ending the shutdown, fueling calls for Schumer's ouster. Rising anti-Semitism drew Barstool's Portnoy ire after a viral clip, while Trump slammed Greene over his Syrian meeting and eyed a $1B BBC lawsuit for J6 edits. Supreme Court rejected Kim Davis's gay marriage appeal; Trump misstated SNAP impacts during shutdown. Pardons strain security via election probes, hit families with aid fears.",
    "source": "https://thehill.com/hilltv/rising/5600201-rising-november-11-2025/"
  }
]