[
  {
    "title": "Senate Advances Bill to End Record Government Shutdown",
    "details": "The U.S. Senate voted 60-40 to advance a bipartisan deal ending the longest government shutdown in history, funding agencies through January and ensuring retroactive pay for federal workers. This comes after over 40 days of gridlock, with Democrats compromising on health subsidies amid economic strain from unpaid workers and disrupted services. The move averts further chaos in air travel and food aid, putting American families and economy first by restoring stability without endless foreign entanglements.",
    "source": "https://www.nytimes.com/live/2025/11/10/us/trump-government-shutdown-news"
  },
  {
    "title": "Flight Cancellations Surge as Shutdown Hits Air Travel",
    "details": "Over 1,700 U.S. flights were canceled Monday due to air traffic controller shortages from the government shutdown, with the FAA mandating further cuts. Unpaid workers' absences exacerbate safety risks and economic losses for airlines and families planning travel. Ending this waste restores efficiency, prioritizing American mobility over bureaucratic gridlock.",
    "source": "https://www.reuters.com/sustainability/sustainable-finance-reporting/airlines-cancel-more-than-1500-us-flights-monday-shutdown-persists-2025-11-10/"
  },
  {
    "title": "Trump Pushes Affordability Narrative Amid Inflation Woes",
    "details": "President Trump vows to tackle affordability in housing, cars, and groceries, blaming Democrats for inflation spikes under his watch. Polls show Americans struggling with costs, prompting proposals like tariff dividends and meat price probes. This focus critiques wasteful spending, emphasizing efficient policies for working families. America First means real relief for citizens, not elite handouts.",
    "source": "https://www.nytimes.com/2025/11/10/us/politics/trump-affordability-inflation-democrats.html"
  },
  {
    "title": "Court Orders Full SNAP Funding During Shutdown Chaos",
    "details": "A federal appeals court upheld an order for full November SNAP benefits to 42 million low-income Americans, blocking Trump administration cuts amid the shutdown. States faced penalties for providing aid, but the ruling ensures food security for families. It highlights government waste in politicizing essentials, putting vulnerable citizens at risk. Prioritizing family nutrition—America's strength lies in strong homes.",
    "source": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-government-shutdown-congress-giuliani-pardon-syria-live-updates-rcna242768"
  },
  {
    "title": "Israeli Soldiers Admit Using Gaza Civilians as Shields",
    "details": "Israeli troops revealed routine use of human shields in Gaza, firing on civilians at aid sites backed by U.S. funds, per a new documentary. This breakdown in rules has led to high casualties, contradicting IDF denials. U.S.",
    "source": "https://www.theguardian.com/world/2025/nov/10/israeli-soldiers-breaking-ranks-gaza-civilians-human-shields"
  },
  {
    "title": "FDA Urges Removal of Hormone Therapy Black Box Warnings",
    "details": "FDA chief Marty Makary directed drugmakers to drop black box warnings on hormone-replacement therapies, citing outdated risks from old studies. This affects menopause treatments for millions of women, amid debates on women's health policies. Streamlining regulations boosts access without feminist overreach, focusing on evidence-based care. Efficient health policy serves American families best.",
    "source": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-chief-makary-asks-drugmakers-remove-warnings-hormone-therapy-2025-11-10/"
  },
  {
    "title": "Girl's Massive Hairball Removed in Rare Surgery",
    "details": "A 10-year-old girl underwent surgery to remove a 10-ounce hairball from her stomach, diagnosed with Rapunzel syndrome from trichophagia. This rare condition highlights mental health needs in children, often linked to stress or family issues. Addressing root causes strengthens family units without government waste. America First invests in kids' well-being at home.",
    "source": "https://nypost.com/2025/11/10/health/10-year-old-girl-has-10-oz-hairball-removed-from-her-stomach/"
  },
  {
    "title": "Canada Loses Measles Elimination Status After Outbreak",
    "details": "Canada lost its 30-year measles elimination status due to a year-long outbreak, failing to contain spread per WHO criteria. This affects cross-border health security with the U.S., urging stronger vaccination efforts. Prioritizing domestic public health over foreign aid ensures safety. Sovereign borders protect American health from global threats.",
    "source": "https://www.reuters.com/business/healthcare-pharmaceuticals/canada-has-lost-its-measles-elimination-status-says-ottawa-2025-11-10/"
  },
  {
    "title": "Trump Blocks States from Full Food Stamp Aid",
    "details": "The Trump administration threatened penalties on states providing full SNAP benefits during shutdown, blocking aid to low-income families. This policy critiques welfare waste but risks hunger for millions reliant on the program. Balancing security and compassion puts working Americans first. End the shutdown—feed families without excess spending.",
    "source": "https://www.foxnews.com/opinion/snap-trump-blamed-blocking-food-assistance-low-income-families"
  },
  {
    "title": "Hegseth Orders Airstrikes on Drug Boats in Pacific",
    "details": "Defense Secretary Pete Hegseth announced airstrikes on alleged drug smuggling vessels in international waters, targeting cartels threatening U.S. security. This action disrupts fentanyl flows, protecting American communities from border threats. Strong defense critiques lax immigration, emphasizing sovereignty.",
    "source": "https://www.foxnews.com/politics/us-carries-out-more-lethal-strikes-alleged-drug-boats-international-waters-secretary-hegseth-says"
  }
]