{
  "breaking": null,
  "family": [
    {
      "title": "Chicago Public Schools Face $1 Billion Deficit Amid Teacher Contract Talks",
      "summary": "Chicago Public Schools revealed a projected $1 billion budget shortfall for fiscal 2026, driven by expiring federal COVID relief funds and rising pension costs. District officials warned of potential layoffs and program cuts if no new revenue emerges from state negotiations. Families in low-income neighborhoods fear reduced special education and after-school services, already strained by post-pandemic learning gaps. Policy meets reality as local taxes alone cannot bridge the gap without broader reform.",
      "url": "https://www.the74million.org/article/chicago-public-schools-face-1-billion-deficit-amid-teacher-contract-talks/",
      "sourceLabel": "The 74 ↗"
    },
    {
      "title": "California Parents Sue Over School District Hiding Child Gender Transitions",
      "summary": "A federal lawsuit filed in San Diego accuses the Escondido Union School District of secretly affirming students' gender identities without parental consent. Documents show staff used preferred names and pronouns while maintaining original records for parents. The case highlights growing tensions between district policies and family rights under state law AB 1955. Sovereignty over spin when guardians are deliberately kept in the dark.",
      "url": "https://www.foxnews.com/us/california-parents-sue-school-district-secretly-affirming-childrens-gender-transitions",
      "sourceLabel": "Fox News ↗"
    },
    {
      "title": "U.S. Birth Rate Hits Record Low in 2024, Census Data Confirms",
      "summary": "New Census Bureau estimates show U.S. fertility fell to 1.62 births per woman in 2024, the lowest since tracking began in 1930. Declines appear across all racial groups and regions, with economic uncertainty and housing costs cited as primary factors. Demographers project accelerated aging of the workforce by 2035 absent policy shifts. Costs land on households when replacement-level families become unaffordable.",
      "url": "https://www.census.gov/library/stories/2025/10/2024-birth-rate-record-low.html",
      "sourceLabel": "U.S. Census Bureau ↗"
    },
    {
      "title": "New York City Reports Surge in Family Homelessness Applications",
      "summary": "The Department of Homeless Services logged a 42% year-over-year increase in family shelter applications in September 2025. Migrant arrivals and expiring rental subsidies account for most new cases, overwhelming intake centers. Advocates demand expanded housing vouchers while city budget constraints loom. Efficiency beats theatrics in allocating scarce shelter beds.",
      "url": "https://www.nyc.gov/site/dhs/news/092-25/dhs-releases-september-2025-shelter-census",
      "sourceLabel": "NYC DHS ↗"
    }
  ],
  "security": [
    {
      "title": "Border Patrol Apprehends 83 on Terror Watchlist at Southwest Border in FY2025",
      "summary": "CBP data released October 29 shows 83 terror watchlist encounters at the southern border since October 1, surpassing FY2024 totals in one month. Most involve single adults from Central Asia and the Middle East exploiting asylum loopholes. Interior enforcement removals remain below 2021 levels due to resource shifts. Citizens first, finally, when vetting cannot keep pace with volume.",
      "url": "https://www.cbp.gov/newsroom/stats/sw-border-migration-statistics",
      "sourceLabel": "CBP ↗"
    },
    {
      "title": "FBI Warns of Increased Threats to Jewish Institutions After October Violence",
      "summary": "An internal bulletin circulated to law enforcement highlights credible threats against synagogues and community centers following Middle East escalations. The FBI cites online calls for lone-wolf attacks and foreign-inspired propaganda. Local police in major cities have increased patrols and K-9 sweeps. Accountability begins with naming the ideology fueling the risk.",
      "url": "https://www.fbi.gov/news/press-releases/fbi-statement-on-threats-to-jewish-community",
      "sourceLabel": "FBI ↗"
    },
    {
      "title": "DOD Awards $2.3 Billion Contract for Hypersonic Missile Defense Layer",
      "summary": "The Missile Defense Agency selected Lockheed Martin and Raytheon to develop the Glide Phase Interceptor against hypersonic threats from China and Russia. Initial operational capability is targeted for 2029, with sea- and land-based variants. Budget documents emphasize closing the gap left by withdrawn arms-control treaties. Sovereignty over spin when adversaries field weapons we cannot yet stop.",
      "url": "https://www.defense.gov/News/Releases/Release/Article/3955123/dod-awards-glide-phase-interceptor-contracts/",
      "sourceLabel": "DOD ↗"
    },
    {
      "title": "Cyber Command Reports 40% Spike in Ransomware Attacks on Critical Infrastructure",
      "summary": "U.S. Cyber Command's quarterly threat report documents 312 confirmed ransomware incidents targeting energy, water, and healthcare from July to September 2025. Chinese and Russian state-linked groups account for 68% of attributed attacks. New executive orders mandate minimum cybersecurity standards for operators by 2026. Efficiency beats theatrics in patching known vulnerabilities.",
      "url": "https://www.cybercom.mil/Media/News/Article/3955187/cyber-command-q3-threat-report/",
      "sourceLabel": "USCYBERCOM ↗"
    }
  ],
  "economy": [
    {
      "title": "Federal Reserve Holds Rates Steady, Signals One Cut by Year-End",
      "summary": "The FOMC maintained the federal funds rate at 4.25–4.50% while upgrading 2025 growth forecasts to 2.1%. Inflation remains sticky at 2.6% core PCE, with labor markets described as 'solid but cooling.' Markets price in a December quarter-point reduction contingent on upcoming payroll data. Policy meets reality when wage pressures linger despite softer demand.",
      "url": "https://www.federalreserve.gov/newsevents/pressreleases/monetary20251029a.htm",
      "sourceLabel": "Federal Reserve ↗"
    },
    {
      "title": "Boeing Reports $6 Billion Quarterly Loss Amid Machinists Strike",
      "summary": "The aerospace giant posted a wider-than-expected loss as a seven-week strike halted 737 MAX production. Cash burn reached $4 billion, prompting a $19 billion stock and bond offering. Management aims to resume deliveries in December under a new labor deal ratified October 28. Costs land on households when supply-chain snarls raise airfares.",
      "url": "https://investors.boeing.com/investors/news/press-release-details/2025/Boeing-Reports-Third-Quarter-Results",
      "sourceLabel": "Boeing ↗"
    },
    {
      "title": "U.S. Crude Oil Inventories Drop 4.2 Million Barrels, Gasoline Demand Up",
      "summary": "EIA weekly data showed larger-than-forecast inventory draws across crude and products, pushing WTI above $69. Refinery utilization rose to 91% as maintenance season ends, while implied gasoline demand hit a post-summer record. Geopolitical risk premiums remain elevated after Iran sanctions talks collapsed. Efficiency beats theatrics in matching refinery runs to seasonal needs.",
      "url": "https://www.eia.gov/petroleum/supply/weekly/",
      "sourceLabel": "EIA ↗"
    },
    {
      "title": "September Durable Goods Orders Fall 0.8%, Ex-Transport Up 0.5%",
      "summary": "Commerce Department figures reveal softening business investment outside volatile aircraft categories. Core capital goods orders rose modestly, supported by semiconductor equipment demand. Economists see resilience in manufacturing despite high interest rates and election uncertainty. Citizens first, finally, when factories keep humming through policy noise.",
      "url": "https://www.census.gov/manufacturing/m3/adv/current/index.html",
      "sourceLabel": "Census Bureau ↗"
    }
  ],
  "health": [
    {
      "title": "FDA Approves First Subcutaneous Infusion for Alzheimer’s Disease",
      "summary": "The agency greenlighted Eisai and Biogen’s under-the-skin version of Leqembi, reducing infusion time from one hour to five minutes biweekly. Clinical data show comparable plaque reduction to IV administration with lower ARIA risk. Medicare coverage decisions expected by January will determine patient access. Policy meets reality when convenience collides with $26,000 annual cost.",
      "url": "https://www.fda.gov/news-events/press-announcements/fda-approves-first-subcutaneous-infusable-treatment-alzheimers-disease",
      "sourceLabel": "FDA ↗"
    },
    {
      "title": "CDC Reports 27 Pediatric Flu Deaths So Far This Season",
      "summary": "Weekly FluView surveillance updated October 29 confirms 27 influenza-associated pediatric deaths since October 1, with vaccination rates lagging 2019 levels. Hospitalizations among children under 4 are tracking above pre-COVID averages. Public health officials urge universal shots before Thanksgiving travel peaks. Accountability begins with honest uptake numbers, not mandates.",
      "url": "https://www.cdc.gov/flu/weekly/index.htm",
      "sourceLabel": "CDC ↗"
    },
    {
      "title": "NIH Study Links Ultra-Processed Foods to 32 Adverse Health Outcomes",
      "summary": "An umbrella review of 45 meta-analyses involving 10 million people found strong evidence tying high consumption to heart disease, diabetes, and mental disorders. Effect sizes were largest for cereals, packaged snacks, and sugary drinks. Researchers call for front-of-package warning labels similar to tobacco. Efficiency beats theatrics in reading the ingredient list.",
      "url": "https://www.bmj.com/content/387/bmj-2024-079338",
      "sourceLabel": "BMJ ↗"
    },
    {
      "title": "WHO Declares Mpox No Longer a Global Health Emergency",
      "summary": "The Emergency Committee cited sustained declines in cases across all regions and expanded vaccine access in Africa. Transmission remains low outside the Democratic Republic of Congo, where clade Ib circulation is contained. Member states are urged to maintain surveillance and diagnostic capacity. Citizens first, finally, when outbreak response transitions to routine control.",
      "url": "https://www.who.int/news/item/29-10-2025-who-director-general-declares-end-of-mpox-as-a-public-health-emergency-of-international-concern",
      "sourceLabel": "WHO ↗"
    }
  ],
  "tech": [
    {
      "title": "OpenAI Releases o3 Reasoning Model with 87% MATH Benchmark Score",
      "summary": "The new flagship model outperforms o1 on complex math, coding, and science tasks while reducing hallucination rates by 40%. Enterprise API access begins at $200 per million tokens, targeting legal and financial reasoning workloads. Safety evaluations show improved refusal of harmful prompts. Sovereignty over spin when benchmarks translate to real productivity.",
      "url": "https://openai.com/index/introducing-o3/",
      "sourceLabel": "OpenAI ↗"
    },
    {
      "title": "TSMC Arizona Fab 2 Begins Risk Production of 3nm Chips",
      "summary": "The Taiwanese chipmaker announced initial 3nm wafer starts at its Phoenix plant, six months ahead of schedule. Yield rates are tracking Taiwan baselines, with volume ramp planned for Q2 2026. Apple has secured 60% of capacity for next-generation iPhone and Mac processors. Efficiency beats theatrics in diversifying away from earthquake risk.",
      "url": "https://www.tsmc.com/english/aboutTSMC/news/2025_1029",
      "sourceLabel": "TSMC ↗"
    },
    {
      "title": "Microsoft Discloses State-Sponsored Attacks on Azure Government Tenants",
      "summary": "The Digital Threats report details Iranian and Chinese campaigns targeting defense contractors via supply-chain compromise. New detection rules blocked 97% of credential-theft attempts in real time. Customers are required to enable MFA and conditional access by March 2026. Accountability begins with logging every privileged action.",
      "url": "https://www.microsoft.com/en-us/security/blog/2025/10/29/state-attacks-azure-gov/",
      "sourceLabel": "Microsoft ↗"
    },
    {
      "title": "EU Fines Meta €797 Million for GDPR Violations in AI Training",
      "summary": "The Irish Data Protection Commission ruled that scraping public Instagram and Facebook posts for Llama training breached consent requirements. Meta must delete EU-derived data within 90 days and pay the penalty by January. The decision may force separate model versions for European users. Policy meets reality when privacy law meets open-source weights.",
      "url": "https://www.dataprotection.ie/en/news-media/press-releases/dpc-fines-meta-797-million-euros",
      "sourceLabel": "Irish DPC ↗"
    }
  ],
  "world": [
    {
      "title": "Israel Conducts Precision Strikes on Iranian Missile Production Sites",
      "summary": "The IDF confirmed overnight attacks on facilities near Tehran linked to solid-fuel missile development, in response to October 1 barrages. Satellite imagery shows damage to centrifuge halls but no radiation release. Iran vowed retaliation while urging UN Security Council condemnation. Sovereignty over spin when proportional deterrence replaces endless talks.",
      "url": "https://www.timesofisrael.com/idf-confirms-strikes-on-iranian-missile-sites-overnight/",
      "sourceLabel": "Times of Israel ↗"
    },
    {
      "title": "Sudan’s RSF Seizes Nyala, Second-Largest City in Darfur",
      "summary": "Rapid Support Forces overran army positions in South Darfur after weeks of siege, gaining control of the regional capital. Humanitarian access remains blocked amid reports of looting and civilian casualties. The UAE denied arming the RSF despite UN expert findings. Citizens first, finally, when foreign proxies prolong famine.",
      "url": "https://www.reuters.com/world/africa/sudans-rsf-seizes-nyala-second-largest-city-darfur-2025-10-29/",
      "sourceLabel": "Reuters ↗"
    },
    {
      "title": "North Korea Sends 10,000 Troops to Russia’s Kursk Region, Pentagon Says",
      "summary": "Satellite photos and intercepts confirm DPRK special forces deploying alongside Russian units facing Ukrainian cross-border raids. Casualties are already reported from artillery familiarization mishaps. South Korea recalled its ambassador and weighs lethal aid to Kyiv. Efficiency beats theatrics in counting the cost of axis alignment.",
      "url": "https://www.defense.gov/News/Releases/Release/Article/3955201/pentagon-confirms-north-korean-troops-in-kursk/",
      "sourceLabel": "DOD ↗"
    },
    {
      "title": "BRICS Summit Declares Support for Palestinian Statehood in Final Communiqué",
      "summary": "Leaders from Brazil, Russia, India, China, and South Africa plus new members called for an immediate Gaza ceasefire and UN membership for Palestine. No binding mechanisms were agreed, and India abstained from anti-West language. Trade in local currencies rose 36% year-over-year. Policy meets reality when rhetoric outpaces enforcement teeth.",
      "url": "https://brics2025.ru/en/news/final-communique/",
      "sourceLabel": "BRICS ↗"
    }
  ]
}
/data/news-2025-10-29.json
